thomasclindsey.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-25 Wed 13:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Thomas C Lindsey (tom)" />
</head>
<body>
<div id="content">

<div id="outline-container-orgc80af44" class="outline-2">
<h2 id="orgc80af44">Thomas C Lindsey</h2>
<div class="outline-text-2" id="text-orgc80af44">
<p>
(801) 762-7486 <br>
Springville, UT <br>
tom@thomasclindsey.com <br>
<a href="https://www.linkedin.com/in/thomas-c-lindsey">https://www.linkedin.com/in/thomas-c-lindsey</a>
</p>
</div>

<div id="outline-container-org094c7ef" class="outline-3">
<h3 id="org094c7ef">Work History, 2006 - 2023</h3>
<div class="outline-text-3" id="text-org094c7ef">
</div>
<div id="outline-container-org9cecbd7" class="outline-4">
<h4 id="org9cecbd7">03/2022 - 10/2023 | Staff / Principal Engineer | Smartbiz Loans | Springville UT / San Francisco CA</h4>
<div class="outline-text-4" id="text-org9cecbd7">
<ul class="org-ul">
<li>Stabilized several projects from departing engineers and then redesigned to make them simpler and easier to understand. I received company wide recognition for my efforts.</li>
<li>Designed and engineered an event based architecture. This allowed us to decouple, strangle and replace functionality into testable, scalable systems in a fast evolving infrastructure.</li>
<li>Provided direction to several teams to simplify and replace a brittle set of services, workers, and database triggers that populated Salesforce with information needed to process, measure, carry out and report on critical business functions.</li>
<li>Created and socialized service and worker templates and libraries to help teams quickly start new projects and provide commonality between services.</li>
<li>Created and socialized common GitHub tasks: static analysis, testing, code formatting, docker image management, software health ratings, pull request templates, etc.</li>
<li>Delivered projects for executive initiatives working with data science and business analytics.</li>
<li>Held regular 1:1s with leaders and individual contributors in the development organization.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd200e3f" class="outline-4">
<h4 id="orgd200e3f">07/2015 - 03/2022 | Sr. Software Architect | ECi Software Solutions | Provo UT / Dallas TX</h4>
<div class="outline-text-4" id="text-orgd200e3f">
<ul class="org-ul">
<li>Led teams in understanding the need for software design and software architecture.</li>
<li>Guided team leaders and teams as we implemented a specific architecture in an iterative manner.</li>
<li>Established a testing culture that valued unit testing and reshaping legacy code in a testable, iterative manner.</li>
<li>Led the construction, design, and delivery of several projects across multiple teams and initiatives to refactor a monolithic thick client application into smaller domains and from there into APIs.</li>
</ul>
</div>
</div>

<div id="outline-container-org6802734" class="outline-4">
<h4 id="org6802734">02/2006 - 07/2015 | Sr Software Engineer | Foundation Source | Provo UT / Fairfield CT</h4>
<div class="outline-text-4" id="text-org6802734">
<ul class="org-ul">
<li>Responsible for the design, implementation and maintenance of a system of web applications and services and databases used by the general public, clients, and administrative users.</li>
<li>Led a small team tasked with redesigning an existing administrative thick client application.</li>
<li>Created custom lightweight AJAX/REST middleware to glue our services to existing sites and applications for the WordPress platform and anticipated mobile hybrid apps.</li>
<li>Designed services and applications for iOS devices, to accommodate user experience and infrastructure requirements for mobile users.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfbd2f36" class="outline-3">
<h3 id="orgfbd2f36">Additional Work History, 1991 - 2006</h3>
<div class="outline-text-3" id="text-orgfbd2f36">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dates</th>
<th scope="col" class="org-left">role</th>
<th scope="col" class="org-left">company</th>
<th scope="col" class="org-left">location</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">10/2002 - 02-2006</td>
<td class="org-left">Engineering Manager</td>
<td class="org-left">Avinti</td>
<td class="org-left">Provo UT</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">04/2001 - 10/2002</td>
<td class="org-left">Development Manager</td>
<td class="org-left">Altiris</td>
<td class="org-left">Provo UT</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">09/1998 - 04/2001</td>
<td class="org-left">Staff Engineer</td>
<td class="org-left">Madison River</td>
<td class="org-left">Orem UT</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">02/1997 - 09/1998</td>
<td class="org-left">Sr Software Engineer</td>
<td class="org-left">Home Financial Network</td>
<td class="org-left">Orem UT</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">06/1991 - 02/1997</td>
<td class="org-left">Software Engineer</td>
<td class="org-left">WordPerfect</td>
<td class="org-left">Orem UT</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Thomas C Lindsey (tom)</p>
<p class="date">Created: 2023-10-25 Wed 13:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
